Revit 2017 API
ViewPlan.SetUnderlayRange Method
 Sets the underlay base and underlay top to the specified levels.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public void SetUnderlayRange(
	ElementId baseLevelId,
	ElementId topLevelId
)
Visual Basic
Public Sub SetUnderlayRange ( _
	baseLevelId As ElementId, _
	topLevelId As ElementId _
)
Visual C++
public:
void SetUnderlayRange(
	ElementId^ baseLevelId,
	ElementId^ topLevelId
)
Parameters
baseLevelId
Type: Autodesk.Revit.DB.ElementId
 The element id of a level in the project or InvalidElementId. If InvalidElementId, then the underlay base level is not set and no elements will be displayed as underlay.
topLevelId
Type: Autodesk.Revit.DB.ElementId
 The element id of a level in the project or InvalidElementId. If InvalidElementId, then the underlay range is unbounded.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The ElementId baseLevelId does not correspond to a Level in the project. -or- The ElementId topLevelId does not correspond to a Level in the project. -or- The elevation of level topLevelId must be greater than the elevation of level baseLevelId.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ViewPlan Class
Autodesk.Revit.DB Namespace